Tekla.Structures.ModelInternal.Serializer
Class for methods which handle serialization and deserialization of structures.

Tekla.Structures.ModelInternal.Serializer.JsonToUDAs(System.Byte[])
Deserializes json data produced by Model!dbHistoryJsonWriteUDAs() into dictionary of properties.
json: The serialized data.
Returns: Properties, in form of name -> value. Type of the value corresponds to the UDA type (int, double or string).

Tekla.Structures.ModelInternal.Serializer.JsonToUDAChanges(System.Byte[])
Deserializes json data produced by Model!dbHistoryJsonWriteUDAChanges.
json: The serialized data.
Returns: The change data.

Tekla.Structures.ModelInternal.Serializer.FixTypes(System.Collections.Generic.Dictionary{System.String,System.Object})
Fix attribute types.
The deserializer makes some undesired in output type. Fix them.
attributes: The UDA dictionary to fix. It's modified inplace.

Tekla.Structures.ModelInternal.Serializer.FixHexes(System.String)
Fix corrupted json which may encode integers as hexadecimals.
json: The suspicous json text.
Returns: The fixed json text.